depot/app/controllers/carts_controller.rb

      def index
        @carts = Cart.all
---
SELECT `carts`.* FROM `carts`

      def show
        begin
        @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1

      def new
        @cart = Cart.new
        @cart.save
---
INSERT INTO `carts` (`created_at`, `title`, `updated_at`) VALUES ('2012-08-13 12:28:25', NULL, '2012-08-13 12:28:25')

      def edit
        @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1

      def create
        @cart = Cart.new(params[:cart])

        respond_to do |format|
          if @cart.save
---
INSERT INTO `carts` (`created_at`, `title`, `updated_at`) VALUES ('2012-08-05 12:13:45', NULL, '2012-08-05 12:13:45')

      def update
        @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1

      def destroy
        @cart = Cart.find(params[:id])
        @cart.line_items.delete_all
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1
DELETE FROM `carts` WHERE `carts`.`id` = 980190962
DELETE FROM `line_items` WHERE `line_items`.`id` = 980190962