depot/app/controllers/line_items_controller.rb

SELECT `line_items`.* FROM `line_items`
---
  def index
    @line_items = LineItem.all

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
  def show
  begin
    @line_item = LineItem.find(params[:id])

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
  def edit
    @line_item = LineItem.find(params[:id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 ORDER BY title LIMIT 1
INSERT INTO `carts` (`created_at`, `title`, `updated_at`) VALUES ('2012-08-05 12:13:49', NULL, '2012-08-05 12:13:49')
INSERT INTO `line_items` (`cart_id`, `created_at`, `price`, `product_id`, `quantity`, `title`, `updated_at`) VALUES (6, '2012-08-13 12:41:16', 9.99, 1, 1, 'MyString', '2012-08-13 12:41:16')
---
  def create
    @cart = current_cart
    @product = Product.find(params[:product_id])
    @line_item = @cart.add_product(@product.id)

    reset_visit_count

    respond_to do |format|
      if @line_item.save

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
---
  def update
    @line_item = LineItem.find(params[:id])

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 980190962 LIMIT 1
DELETE FROM `line_items` WHERE `line_items`.`id` = 980190962
---
  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy