depot/app/controllers/products_controller.rb

  def index
    @cart = current_cart
    @products = Product.all
---
SELECT `products`.* FROM `products` ORDER BY title

  def show
  begin
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 ORDER BY title LIMIT 1

  def edit
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 ORDER BY title LIMIT 1

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `description`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2012-07-15 18:49:18', 'laptop', 'rails.png', 99999999.99, 'Macbook123', '2012-07-15 18:49:18')

  def update
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 ORDER BY title LIMIT 1

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 ORDER BY title LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 980190962